num='00 28 28 1D 20 23 28 1B 65 20 32 28 2E 20 2C 28 25 2F 1E 1D 20 28 27 1E 20 26 28 2B 1E 20 1C 21 1A 25 25 1E 27 20 1E 20 22 27 20 32 28 2E 2B 20 23 28 2E 2B 27 1E 32 67 20 0D 21 22 2C 20 28 27 1E 20 30 1A 2C 20 1F 1A 22 2B 25 32 20 1E 1A 2C 32 20 2D 28 20 1C 2B 1A 1C 24 67 20 10 1A 2C 27 60 2D 20 22 2D 78 20 6A 6B 71 20 24 1E 32 2C 20 22 2C 20 1A 20 2A 2E 22 2D 1E 20 2C 26 1A 25 25 20 24 1E 32 2C 29 1A 1C 1E 65 20 2C 28 20 22 2D 20 2C 21 28 2E 25 1D 27 60 2D 20 21 1A 2F 1E 20 2D 1A 24 1E 27 20 32 28 2E 20 2D 28 28 20 25 28 27 20 20 2D 28 20 1D 1E 1C 2B 32 29 2D 20 2D 21 22 2C 20 26 1E 2C 2C 1A 20 1E 67 20 10 1E 25 25 20 1D 28 27 1E 65 20 32 28 2E 2B 20 2C 28 25 2E 2D 22 28 27 20 22 2C 20 2C 22 1F 21 1B 1D 21 21 20 27 21 1F 67'
hnum = num.split(' ')    #密文以空格分隔，存在列表中
 
onum = []
 
for i in hnum:
    onum.append(int(i,16))     #密文转换成10进制数
 
for i in range(128):     #循环移位
    a = []
    for j in onum:
        a.append(chr(j+i))   #转化为字符
    a1 = "".join(a)          #字符拼接为字符串
    print(a1)
    print("\n")
